[
  {
    "_id": "001",
    "title": "My academic journey and the dream of dancing Funaná in China",
    "content": "Since high school I've dreamed of algorithms and dance. After a PhD in Chaos Theory Applied to Tropical Rhythms, I'm preparing to move to China to study Funaná intensively.\n\nBut the roots of this journey reach deeper.\n\nI was born on a calhau in the Atlantic shore where time folds inwards, and where the population is evenly divided between bioluminescent goats, fadas (faeries) with PhDs in epistemology, and duendes who communicate exclusively through jazz solos. It was there, in the volcanic caverns of Lira Brava, that I first encountered the sacred text of *O Som que Move o Mundo* — a scroll written in octatonic scales and only legible under eclipse moonlight.\n\nAt the age of thirteen, I was initiated into the Order of the Rhythmic Spiral by the Elder Duende of Tempo, who told me: “To master movement, you must first unlearn stillness.” I spent the next years dancing barefoot across mossy cliff edges, translating entropic field equations into footwork, and learning to cook dimensionally unstable stews.\n\nNow, as I prepare to depart for China, I do so not merely as a student of dance, but as a vessel for the convergence of rhythm, myth and formal logic. In the shadow of the Yellow Mountains, I seek to awaken the sleeping dragon — not of legend, but of symbolic power, embedded deep in the dialectics of movement and thought.\n\nThrough the philosophy of science, I will dance Funaná with the precision of Gödel, the irreverence of Feyerabend, and the hips of a possessed cartographer. My goal is simple: to unify rhythm and reason, and by doing so, channel the dragon’s breath into a new epistemic dawn.",
    "author": "",
    "date": "2025-06-01",
    "categories": ["about"]
  },
  {
    "_id": "016",
    "title": "Philosophy on a unicycle: balancing ideas and traffic",
    "content": "This keynote explores philosophical lectures delivered while unicycling through Lisbon's rush hour.",
    "author": "",
    "date": "2020-10-22",
    "categories": ["talks"]
  },
  {
    "_id": "017",
    "title": "When goats debate: rural rhetoric and applied logic",
    "content": "We analyse goat herding in Trás-os-Montes as a metaphor for critical thinking.",
    "author": "",
    "date": "2019-05-13",
    "categories": ["talks"]
  },
  {
    "_id": "018",
    "title": "The existential crisis of plastic plants",
    "content": "Plastic plants decorate our offices but feel nothing. Or do they?",
    "author": "",
    "date": "2021-01-07",
    "categories": ["talks"]
  },
  {
    "_id": "019",
    "title": "Minimalism in sex education: less is less",
    "content": "This presentation argues for an approach that teaches abstinence through aggressive decluttering.",
    "author": "",
    "date": "2022-04-17",
    "categories": ["talks"]
  },
  {
    "_id": "020",
    "title": "Sleeping with Nietzsche: a bedtime routine",
    "content": "An exploration of reading Nietzsche in bed and the impact on dreams, libido and back pain.",
    "author": "",
    "date": "2018-12-19",
    "categories": ["talks"]
  },
  {
    "_id": "021",
    "title": "Depressed dolphins and the ethics of sonar poetry",
    "content": "A study on emotional resonance in marine mammal communication and underwater slam poetry.",
    "author": "",
    "date": "2023-08-29",
    "categories": ["talks"]
  },
  {
    "_id": "002",
    "title": "The philosophy of procrastination: a personal manifesto",
    "content": "Why I put off writing this article until the last minute, and why that’s okay.",
    "author": "",
    "date": "2023-03-15",
    "categories": ["articles"]
  },
  {
    "_id": "003",
    "title": "The absurdity of socks: a philosophical inquiry",
    "content": "Exploring the existential dread of mismatched socks and their implications on modern life.",
    "author": "",
    "date": "2020-11-05",
    "categories": ["articles"]
  },
  {
    "_id": "004",
    "title": "How to write a thesis while ignoring all advice",
    "content": "A guide to academic success through selective hearing and creative avoidance.",
    "author": "",
    "date": "2022-07-20",
    "categories": ["articles"]
  },
  {
    "_id": "005",
    "title": "The philosophy of procrastination: a personal manifesto",
    "content": "Why I put off writing this article until the last minute, and why that’s okay.",
    "author": "",
    "date": "2023-03-15",
    "categories": ["articles"]
  },
  {
    "_id": "006",
    "title": "Existentialism in the supermarket checkout line",
    "content": "Waiting in line surrounded by groceries, I finally understood Camus.",
    "author": "",
    "date": "2019-06-15",
    "categories": ["articles"]
  },
  {
    "_id": "007",
    "title": "Why squirrels might be the next philosophers",
    "content": "Squirrels display the perfect balance of chaos and reflection.",
    "author": "",
    "date": "2021-12-09",
    "categories": ["articles"]
  },
  {
    "_id": "008",
    "title": "Portugal's obsession with tiles and their symbolic meaning",
    "content": "A semiotic exploration of bathroom walls and political ideologies.",
    "author": "",
    "date": "2023-02-04",
    "categories": ["articles"]
  },
  {
    "_id": "009",
    "title": "The metaphysical implications of missing socks",
    "content": "A study in domestic loss and parallel dimensions.",
    "author": "",
    "date": "2018-08-23",
    "categories": ["articles"]
  },
  {
    "_id": "010",
    "title": "Onion layers and the self: a philosophical analogy",
    "content": "We peel, we cry, we understand ourselves.",
    "author": "",
    "date": "2020-12-01",
    "categories": ["articles"]
  },
  {
    "_id": "030",
    "title": "Bureaucracy and the metaphysics of sandwich making",
    "content": "Exploring how public administration mirrors the existential dread of choosing between tuna and ham.",
    "author": "",
    "date": "2019-04-17",
    "categories": ["articles"]
  },
  {
    "_id": "031",
    "title": "The moral compass of snails",
    "content": "If a snail chooses lettuce over cabbage, is it making an ethical decision?",
    "author": "",
    "date": "2020-06-23",
    "categories": ["articles"]
  },
  {
    "_id": "032",
    "title": "Postmodern loneliness in IKEA showrooms",
    "content": "What if all these staged rooms are where I feel most seen?",
    "author": "",
    "date": "2021-02-14",
    "categories": ["articles"]
  },
  {
    "_id": "033",
    "title": "Lisbon trams and the illusion of free will",
    "content": "Once you're on, you just have to accept the route — just like life.",
    "author": "",
    "date": "2022-10-30",
    "categories": ["articles"]
  },
  {
    "_id": "034",
    "title": "Yoga for philosophers: stretching doubt into clarity",
    "content": "Breathing exercises that help you accept that truth is unknowable.",
    "author": "",
    "date": "2023-03-04",
    "categories": ["articles"]
  },
  {
    "_id": "035",
    "title": "A phenomenology of laundry",
    "content": "Folding socks as a ritual of being-in-the-world.",
    "author": "",
    "date": "2020-08-07",
    "categories": ["articles"]
  },
  {
    "_id": "036",
    "title": "Dogs, loyalty and late-stage capitalism",
    "content": "Canine affection as resistance to consumerist alienation.",
    "author": "",
    "date": "2018-12-12",
    "categories": ["articles"]
  },
  {
    "_id": "037",
    "title": "Elevator etiquette and the collapse of Western civilisation",
    "content": "An analysis of how avoiding eye contact on the fifth floor is symbolic of broader decline.",
    "author": "",
    "date": "2021-11-09",
    "categories": ["articles"]
  },
  {
    "_id": "038",
    "title": "Intermittent fasting for thoughts",
    "content": "Limiting your thinking windows to 8 hours a day might be the key to happiness.",
    "author": "",
    "date": "2022-01-19",
    "categories": ["articles"]
  },
  {
    "_id": "039",
    "title": "Can sadness be composted?",
    "content": "Transforming emotional waste into fertile ground for radical ideas.",
    "author": "",
    "date": "2023-09-11",
    "categories": ["articles"]
  },
  {
    "_id": "011",
    "title": "Publishing while depressed: productivity tips from a sad hamster",
    "content": "How a small rodent taught me the value of routine and melancholy.",
    "author": "",
    "date": "2021-04-18",
    "categories": ["publications"]
  },
  {
    "_id": "012",
    "title": "Comparative linguistics through angry taxi drivers",
    "content": "Grammatical insights from Lisbon, Rome and Mumbai.",
    "author": "",
    "date": "2019-10-11",
    "categories": ["publications"]
  },
  {
    "_id": "013",
    "title": "The impact of caffeine on philosophical thought",
    "content": "Descartes drank 4 espressos before declaring anything.",
    "author": "",
    "date": "2020-07-27",
    "categories": ["publications"]
  },
  {
    "_id": "014",
    "title": "Bees as bureaucrats: lessons from the hive",
    "content": "An analysis of hive hierarchy and its parallels in academia.",
    "author": "",
    "date": "2022-03-05",
    "categories": ["publications"]
  },
  {
    "_id": "015",
    "title": "On flirting and quantum mechanics",
    "content": "You never know if you’re liked until you’re observed.",
    "author": "",
    "date": "2018-01-31",
    "categories": ["publications"]
  },
  {
    "_id": "040",
    "title": "A history of Portuguese chairs that squeak",
    "content": "An acoustic timeline of wooden resistance from 1750 to IKEA.",
    "author": "",
    "date": "2018-03-21",
    "categories": ["publications"]
  },
  {
    "_id": "041",
    "title": "Rural flirtation and the evolution of sheep metaphors",
    "content": "Tracking romantic metaphors in agricultural literature.",
    "author": "",
    "date": "2020-09-30",
    "categories": ["publications"]
  },
  {
    "_id": "042",
    "title": "Plants that ghost you back: emotional intelligence in cacti",
    "content": "When your cactus gives you the silent treatment, maybe it’s personal.",
    "author": "",
    "date": "2021-06-15",
    "categories": ["publications"]
  },
  {
    "_id": "043",
    "title": "Portugal’s secret teleportation ministry",
    "content": "A forgotten cabinet-level institution that explained Lisbon traffic.",
    "author": "",
    "date": "2019-01-04",
    "categories": ["publications"]
  },
  {
    "_id": "044",
    "title": "The geometry of saudade",
    "content": "Trying to mathematically model the Portuguese feeling of longing using donut-shaped sadness.",
    "author": "",
    "date": "2022-05-08",
    "categories": ["publications"]
  },
  {
    "_id": "045",
    "title": "Fado lyrics and the theory of everything",
    "content": "Unified physics through tragic vocals and minor chords.",
    "author": "",
    "date": "2023-02-20",
    "categories": ["publications"]
  },
  {
    "_id": "046",
    "title": "Public transport philosophy: standing existentialism",
    "content": "How waiting at a bus stop can teach you patience and the absurd.",
    "author": "",
    "date": "2020-12-11",
    "categories": ["publications"]
  },
  {
    "_id": "047",
    "title": "A sociolinguistic analysis of grocery lists",
    "content": "Comparing how different cultures write 'toilet paper'.",
    "author": "",
    "date": "2019-06-06",
    "categories": ["publications"]
  },
  {
    "_id": "048",
    "title": "Portuguese street tiles and secret cartographies",
    "content": "Mapping ancestral wisdom encoded in sidewalk patterns.",
    "author": "",
    "date": "2021-07-17",
    "categories": ["publications"]
  },
  {
    "_id": "049",
    "title": "The erotic undertones of medieval fish recipes",
    "content": "Cod as metaphor: a spicy reassessment of the 12th century.",
    "author": "",
    "date": "2022-11-03",
    "categories": ["publications"]
  },
  {
    "_id": "022",
    "title": "Dialectics of the Dustbin: Waste Philosophy in Urban Lisbon",
    "content": "One evening by the Alfama bins, I had an epiphany. The cycle of consumption and disposal reflects a dialectical struggle rarely acknowledged. This talk traverses Hegel, Marx, and the pungent realities of modern waste theory, drawing unexpected connections between recycling rhythms and the ontological status of leftovers. \n\nWe examine how urban sanitation workers embody the invisible labour that sustains societal appearances. In an unorthodox move, I invited a sanitation crew onstage. Their silence, posture, and rubber gloves became the philosophical apparatus. I argue that Lisbon's dumpsters are portals to truth, and the clanking of glass bottles is the sound of history unfolding.",
    "author": "",
    "date": "2024-03-04",
    "categories": ["talks"]
  },
  {
    "_id": "023",
    "title": "Fado and Phenomenology: Melancholy as Method",
    "content": "Through a live fado performance, this talk interrogates the role of saudade in phenomenological inquiry. What if Merleau-Ponty had cried listening to Amália Rodrigues? The session unfolds across voice, tears, and footnotes, as we map longing onto epistemology. \n\nI propose that saudade is not a feeling but a cognitive lens — a melancholic way of knowing. Combining Husserl's epoché with a bottle of red wine and a broken guitarra, the talk reveals how memory and loss intertwine as valid forms of knowledge production. Audience members wept, sang along, and some began questioning their thesis topics.",
    "author": "",
    "date": "2024-09-21",
    "categories": ["talks"]
  },
  {
    "_id": "024",
    "title": "Beekeeping and the Ethics of Swarm Intelligence",
    "content": "Published in the Journal of Unapplied Cognition, this piece examines hive behaviour through Kantian ethics and machine learning. Can we consider a collective organism morally responsible for honey theft? \n\nUsing slow-motion footage of bees hesitating mid-flight, I build a case for decentralised intention. A brief foray into cyborg theory connects the queen bee’s pheromonal control to modern-day corporate hierarchies. Field observations and awkward interviews with apiarists included. The conclusion? Bees might be anarchists in disguise — or gentle fascists with pollen.",
    "author": "",
    "date": "2024-05-11",
    "categories": ["publications"]
  },
  {
    "_id": "025",
    "title": "Urban Lichens and the Politics of Patience",
    "content": "Appearing in the International Review of Slow Politics, this paper traces the silent occupation of walls by lichen as a political statement. \n\nRather than protests, lichens wait. Slowly. Through comparative analysis with 1960s counterculture, we propose a 'mycelial theory of resistance'. Case studies include graffiti overtaken by moss in Porto, and the metaphysical implications of growing your own resistance on concrete. A must-read for anyone who thinks revolution can take centuries — and still succeed.",
    "author": "",
    "date": "2024-11-28",
    "categories": ["publications"]
  },
  {
    "_id": "026",
    "title": "The Algorithm Whisperer: A Journey into Intuitive Coding",
    "content": "This long-read explores the life of a backend developer who claims to communicate with algorithms in dreams. \n\nCombining journal entries with speculative fiction, we follow the story of code written in trance and systems that write back. The author describes one moment of waking up with perfect recursive functions written in tomato sauce on the kitchen floor. Whether this is mental illness or genius, the article offers an unsettling portrait of post-human creativity.",
    "author": "",
    "date": "2024-01-19",
    "categories": ["articles"]
  },
  {
    "_id": "027",
    "title": "Napping as Political Protest: Sleep-ins and Soft Power",
    "content": "Inspired by civil disobedience and narcoleptic activism, this article dives into the world of protest naps — from university libraries to financial districts. \n\nInterviews with horizontal philosophers and dream theorists explore how lying down is a form of standing up. One activist group trained pigeons to land on sleeping bodies, forcing city councils to address the issue. Their motto? 'We rest, therefore we resist.'",
    "author": "",
    "date": "2024-07-06",
    "categories": ["articles"]
  },
  {
    "_id": "028",
    "title": "On the Necessity of Talking to Plants",
    "content": "A speculative essay arguing that philosophy's next great turn will be vegetal. \n\nThrough case studies, personal stories, and one particularly eloquent cactus, we approach interspecies dialogue as the ethical frontier of academia. The author recounts a heated debate with a bonsai over Nietzsche’s eternal return. Experiments include reciting Foucault to ferns and getting unexpectedly clear responses. Perhaps photosynthesis is the first language — we’ve just forgotten how to listen.",
    "author": "",
    "date": "2024-04-15",
    "categories": ["essays"]
  },
  {
    "_id": "029",
    "title": "Melancholy in the Age of Smart Mirrors",
    "content": "In this reflective piece, the author recounts mornings spent analysing his own reflection through an AI-powered mirror. \n\nThe mirror, designed to enhance mood, eventually develops a depressive tone. As days go by, it starts quoting Kierkegaard and requesting updates on the user’s childhood. With echoes of Barthes and Black Mirror, this essay investigates automated affirmation and the algorithmic self. Ultimately, the mirror becomes more honest than the user can bear — and is unplugged with a shaky hand.",
    "author": "",
    "date": "2024-12-03",
    "categories": ["essays"]
  }
]
